#основной дата фрейм
df = data.frame(
  Студент = c("Алексеев Дмитрий", "Ан Инесса", "Бабаков Степан", "Галан Андрей", "Гребенюк Алексей", "Дочкин Виталий","Жушман Захар","Ким Данил","Козел Екатерина","Мартиросов Давид",
              "Мельниченко Диана","Никульников Федор","Новиков Владислав","Попов Евгений","Ручкин Владислав","Ульяницкий Никита","Шешунов Михаил","Юдин Михаил","Яхонтов Артем"),
  Восемь = c(7,4,8,0,8,6,8,3,10,8,8,10,10,2,6,8,7,8,10),
  Шесть = c(6,7,6,2,6,6,6,3,6,6,6,10,10,6,6,6,3,6,9),
  Девять = c(7,7,9,3,9,8,9,4,9,9,9,9,10,8,8,9,5,9,8),
  Четыре = c(5,10,4,4,4,8,4,4,4,4,4,4,10,5,8,4,2,4,7),
  Один = c(7,10,10,5,1,7,1,3,1,1,1,2,10,3,7,1,0,1,5),
  Ноль = c(4,2,10,6,0,7,0,7,0,0,0,7,10,2,7,0,1,1,5),
  Два = c(7,1,2,7,2,7,2,3,2,2,2,3,10,7,7,2,4,3,4),
  Пять = c(9,2,10,8,5,8,5,8,5,5,5,5,10,8,8,5,9,4,3),
  Три = c(6,0,10,9,3,7,3,10,3,3,3,7,10,5,7,3,6,5,2),
  Семь = c(5,10,10,10,7,4,7,9,7,3,7,8,10,3,4,7,8,10,1));df

#1
#фрейм макс
df_max = data.frame(
  Цифра = c("Восемь","Шесть","Девять","Четыре","Один","Ноль","Два","Пять","Три","Семь"),
  Максимум = c(max(df[,c("Восемь")]),max(df[,c("Шесть")]),max(df[,c("Девять")]),max(df[,c("Четыре")]),max(df[,c("Один")]),max(df[,c("Ноль")])
               ,max(df[,c("Два")]),max(df[,c("Пять")]),max(df[,c("Три")]),max(df[,c("Семь")])));df_max

#фрейм мин
df_min = data.frame(
  Цифра = c("Восемь","Шесть","Девять","Четыре","Один","Ноль","Два","Пять","Три","Семь"),
  Минимум = c(min(df[,c("Восемь")]),min(df[,c("Шесть")]),min(df[,c("Девять")]),min(df[,c("Четыре")]),min(df[,c("Один")]),min(df[,c("Ноль")])
               ,min(df[,c("Два")]),min(df[,c("Пять")]),min(df[,c("Три")]),min(df[,c("Семь")])));df_min

#фрейм средн
df_mean = data.frame(
  Цифра = c("Восемь","Шесть","Девять","Четыре","Один","Ноль","Два","Пять","Три","Семь"),
  Среднее = c(mean(df[,c("Восемь")]),mean(df[,c("Шесть")]),mean(df[,c("Девять")]),mean(df[,c("Четыре")]),mean(df[,c("Один")]),mean(df[,c("Ноль")])
              ,mean(df[,c("Два")]),mean(df[,c("Пять")]),mean(df[,c("Три")]),mean(df[,c("Семь")])));df_mean

#2
#фрейм людей которые выбрали >7 и <3
fill_all <-c()
for (i in 1:10){
  p<-df[,i]
  fill_all<-c(fill_all,length(p[which(p<3 | p>7)]))
}
sum(fill_all)

#3
a<-order(df_mean[,"Среднее"],decreasing = TRUE);a
df_mean[a,]

#4
fill_colors <- c()
for ( i in 1:length(df_mean[,c("Среднее")]) ) {
  if (df_mean[,c("Среднее")][i] > 6){
    fill_colors <- c(fill_colors, "#00FF00")
  } else {
    fill_colors <- c(fill_colors, "#FF0000")
  }
}

p<-df_mean[,c("Среднее")]
q<-df_mean[,c("Цифра")]
barplot(p,names.arg = q, col = fill_colors,
        xlab = "Рейтинг",
        ylab = "Цифры",
        main="Топ лучших цифр",
        width = sqrt(p))
